
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Задачи.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.РегистрацияВремени КАК РегистрацияВремени
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Задачи КАК Задачи
	//	|		ПО РегистрацияВремени.Задача = Задачи.Ссылка
	//	|ГДЕ
	//	|	РегистрацияВремени.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Ссылка = Выборка.Ссылка;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	Задачи.Проект КАК Проект,
					|	РегистрацияВремени.ВремяНачала КАК ВремяНачала,
					|	РегистрацияВремени.ВремяОкончания КАК ВремяОкончания
					|ИЗ
					|	Документ.РегистрацияВремени КАК РегистрацияВремени
					|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Задачи КАК Задачи
					|	ПО (РегистрацияВремени.Задача = Задачи.Ссылка)
					|ГДЕ
					|	РегистрацияВремени.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Проект = Выборка.Проект;
	ВремяНачала = Выборка.ВремяНачала;
	ВремяОкончания = Выборка.ВремяОкончания;
	
	//потррачено = оконч - начала
	ВНЧисло = Час(ВремяНачала)*60 + Минута(ВремяНачала) + Секунда(ВремяНачала)/60;
	ВОЧисло = Час(ВремяОкончания)*60 + Минута(ВремяОкончания) + Секунда(ВремяОкончания)/60; 
	ПотраченоМинут = ВОЧисло - ВНЧисло;
	
	
	// регистр ИспользованоВремени Приход
	Движения.ИспользованоВремени.Записывать = Истина;
	Движение = Движения.ИспользованоВремени.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Задача = Задача;
	Движение.Проект = Проект;
	Движение.ПотраченоМинут = ПотраченоМинут;

	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(ВремяНачала) И НЕ ЗначениеЗаполнено(ВремяОкончания) Тогда
		ВызватьИсключение "Заполните время началы и окончания!";
		//Отказ = истина;
	КонецЕсли; 
	
	ПотраченоВремени = ВремяОкончания - ВремяНачала;
	
	Если ПотраченоВремени <=0 Тогда
	     ВызватьИсключение "Время окончания не может быть раньше или равно времени начала!";
		 //Отказ = истина;
	КонецЕсли;
	
	Если ПотраченоВремени <= 60 Тогда
		ВызватьИсключение "Длительность меньше минуты.";
		//Отказ = истина;
	Иначе
		ПотраченоВремени = ПотраченоВремени / 60; 
		
	КонецЕсли;    
	
КонецПроцедуры  

