
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ФактБюджета 
	Движения.ФактБюджета.Очистить();	
	Движения.ФактБюджета.Записывать = Истина;
	Для Каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.ФактБюджета.Добавить();
		Движение.Период = Дата;
		Движение.Месяц = НачалоМесяца(Дата);
		Движение.Статья = ТекСтрокаОперации.Статья;
		Движение.СуммаФакт = ТекСтрокаОперации.Сумма;
	КонецЦикла;
	
	
	     //регистр ОстаткиДенег 
	Движения.ОстаткиДенег.Очистить();
	
	//запись ссылок на статьи в массив
	МассивСтатей = Новый Массив;
	Для Каждого ТекСтрокаОперации Из Операции Цикл
		МассивСтатей.Добавить(ТекСтрокаОперации.Статья);
	КонецЦикла;  
	
	//запись соответсвия ключ-ссылка на статью, значение-ключ
	СоответствиеТипа = Новый Соответствие;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	СтатьиБюджета.Тип КАК Тип, 
					|	СтатьиБюджета.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.СтатьиБюджета КАК СтатьиБюджета
					|ГДЕ
					|	СтатьиБюджета.Ссылка В(&МассивСтатей)"; 
	
	Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		СоответствиеТипа.Вставить(Выборка.Ссылка, Выборка.Тип);
	КонецЦикла; 
	
	//запись движений
	Движения.ОстаткиДенег.Записывать = Истина; 
	
	Для каждого ТекСтрокаОперации Из Операции Цикл
		Движение = Движения.ОстаткиДенег.Добавить();
		ТипОперации = СоответствиеТипа.Получить(ТекСтрокаОперации.Статья);
		
		Если НЕ ТипОперации = Неопределено Тогда
			
			Если ТипОперации = Перечисления.ДоходРасход.Доход Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе 	 
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;	
			
			Движение.Период = Дата;
			Движение.Счет = ТекСтрокаОперации.Счет;
			Движение.Сумма = ТекСтрокаОперации.Сумма;

		КонецЕсли;
	
	КонецЦикла;
		 
КонецПроцедуры	
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТЧ = ЭтотОбъект.Операции;
	Отказ = ПроверкаНаПустуюТЧ(ТЧ);
	
КонецПроцедуры
	