
&НаКлиенте
Процедура ЗасечьВремя(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Задача) Тогда
		ПоказатьПредупреждение(, "Выберите задачу!");
		Возврат;
	КонецЕсли;
	
	// Запоминаем время старта в реквизите обработки (Объект.ВремяСтарта)
	Объект.ВремяСтарта = ТекущаяДата();
	
	
	Сообщить("⏱ Время по задаче """ + Объект.Задача + """ засечено с " + Формат(Объект.ВремяСтарта, "ДФ=чч:мм:сс"));

КонецПроцедуры

&НаСервере
Функция СоздатьДокументПоВремени(Секунд, ВремяСтарта)
	
	Док = Документы.РегистрацияВремени.СоздатьДокумент();
	Док.Задача = Объект.Задача;
	Док.Дата = ТекущаяДата();
	Док.ВремяНачала = ВремяСтарта;
	Док.ВремяОкончания = ТекущаяДата();
	Док.ПотраченоВремени = Секунд;
	Док.Комментарий = "Засечено через таймер";
	Док.Записать(РежимЗаписиДокумента.Проведение);
		
	Возврат Док.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура Остановить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Задача) Тогда
		ПоказатьПредупреждение(, "Выберите задачу!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВремяСтарта) Тогда
		ПоказатьПредупреждение(, "Сначала засеките время!");
		Возврат;
	КонецЕсли;
	
	// Считаем разницу
	ТекущееВремя = ТекущаяДата();
	РазницаСекунд = ТекущееВремя - Объект.ВремяСтарта;
	
	// Вызываем серверную функцию
	СоздатьДокументПоВремени(РазницаСекунд, Объект.ВремяСтарта);
	
	// Обнуляем засечку, чтобы не мешала
	Объект.ВремяСтарта = Дата(1,1,1);
		
	Сообщить("✅ Документ создан. Время: " + РазницаСекунд + " сек.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТаймер(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВремяСтарта) Тогда
	     Сообщить ("Таймер не был запущен!")
	 Иначе
		  Объект.ВремяСтарта = неопределено;
		 Сообщить("❌ Таймер отменен!") 
		
	КонецЕсли;
	
	
КонецПроцедуры
