
&НаСервере
Функция ЗаполнитьПоПрошломуНаСервере(ПериодТ)
	
	ПланПоСтатьям = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПланБюджетаРССрезПоследних.Статья КАК Статья,
					|	ПланБюджетаРССрезПоследних.СуммаПлан КАК СуммаПлан,
					|	ПланБюджетаРССрезПоследних.Период КАК ПериодСреза
					|ИЗ
					|	РегистрСведений.ПланБюджетаРС.СрезПоследних(&ПериодТ) КАК ПланБюджетаРССрезПоследних";   
	
	Запрос.УстановитьПараметр("ПериодТ", ПериодТ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПериодСреза <> ПериодТ Тогда
			Возврат неопределено;
		КонецЕсли;
		ПланПоСтатьям.Вставить(Выборка.Статья, Выборка.СуммаПлан);
	КонецЦикла; 	
	
	Возврат ПланПоСтатьям;     
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоПрошлому(Команда)     
	
	Объект.ПланыБюджета.Очистить();
	
	ПериодТ = ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1); 
	ПланПоСтатьям = ЗаполнитьПоПрошломуНаСервере(ПериодТ);
	
	Если 	ПланПоСтатьям = неопределено Тогда
		ПоказатьПредупреждение(, "За прошлый месяц нет плановых данных для заполнения!");
		Возврат;		
	КонецЕсли;
	
	Для каждого Пара Из ПланПоСтатьям Цикл
	
		НоваяСтрока = Объект.ПланыБюджета.Добавить();
		НоваяСтрока.Статья = Пара.Ключ;
		НоваяСтрока.Сумма = Пара.Значение;
	
	КонецЦикла;
			
 КонецПроцедуры

 
