

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ПланБюджетаРС
	Движения.ПланБюджетаРС.Записывать = Истина;
	Для Каждого ТекСтрокаПланыБюджета Из ПланыБюджета Цикл
		Движение = Движения.ПланБюджетаРС.Добавить();
		Движение.Период = Дата;
		Движение.Статья = ТекСтрокаПланыБюджета.Статья;
		Движение.СуммаПлан = ТекСтрокаПланыБюджета.Сумма;
	КонецЦикла;


КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТЧ = ЭтотОбъект.ПланыБюджета;
	Отказ = ПроверкаНаПустуюТЧ(ТЧ);
	
КонецПроцедуры



     







 


